# pandas: A Short Tutorial
-  pandas contains data structures and data manupulation tools for fast and easy data cleaning and analysis. 
-  pandas is often used in tandem with Numpy, scikit-learn and matplotlib. 
-  pandas is designed for working with tabular or heterogeneous data, while Numpy is best suited for working with homegeneous numerical array data.

In [1]:
# import pandas
import pandas as pd
from pandas import Series, DataFrame
# import Numpy
import numpy as np

## pandas Data Structures

### Series
-  A Series is a one-dimensional array-like object containing a sequence of values and data labels (index).
-  Attributes
    - .index returns an *Index* object
    - .values returns an ndarray

In [24]:
# creating a Series with an index
aobj = Series([1, -2, 3, -4], index = ['a', 'c', 'b', 'd'])
aobj

a    1
c   -2
b    3
d   -4
dtype: int64

In [ ]:
# Index objects are immutable
print(aobj.index)
aobj.index[1:]

In [ ]:
# similar to a dictionary
'a' in aobj

In [ ]:
# insert an object
aobj['e'] = 5
aobj

In [ ]:
# delete an object
del aobj['e']
aobj

In [25]:
# data retrieval by label
print(aobj['c'])
aobj[['a', 'b', 'c']]   # a list of indices

-2

a    1
b    3
c   -2
dtype: int64

In [ ]:
# slicing by label
aobj['a':'b']     # the last label is inclusive!

In [ ]:
# data retrieval by integer position
print(aobj[1])
# slicing
aobj[:2]   # the last integer position is exclusive!

In [ ]:
# revising index
aobj.index = ['e', 'g', 'h', 'f']
aobj

In [ ]:
# .values attribute
aobj.values    # a numpy 1-d array

In [ ]:
# filtering
aobj[aobj > 0]

In [ ]:
# vectorization
aobj * 2

In [ ]:
# numpy universal function
np.abs(aobj)

In [27]:
# converting a dictionary to a Serie
sdict = {'Mike': 3.4, 'Mary': 3.8, 'David': 3.0, 'Jack': 2.75}
sobj = Series(sdict)
sobj

Mike     3.40
Mary     3.80
David    3.00
Jack     2.75
dtype: float64

In [28]:
# NaN = missing values
sobj2 = pd.Series(sdict, index = ['Alex', 'David', 'Jack', 'Mary'] )
sobj2

Alex      NaN
David    3.00
Jack     2.75
Mary     3.80
dtype: float64

In [29]:
# isnull() and notnull() detect missing values
print(pd.isnull(sobj2))
print(pd.notnull(sobj2))
sobj2.isnull()

Alex      True
David    False
Jack     False
Mary     False
dtype: bool
Alex     False
David     True
Jack      True
Mary      True
dtype: bool

Alex      True
David    False
Jack     False
Mary     False
dtype: bool

In [30]:
# data alignment 
(sobj + sobj2)/2

Alex      NaN
David    3.00
Jack     2.75
Mary     3.80
Mike      NaN
dtype: float64

In [31]:
# .name property
sobj.name = 'GPA'
sobj.index.name = 'Student'
sobj

Student
Mike     3.40
Mary     3.80
David    3.00
Jack     2.75
Name: GPA, dtype: float64

### DataFrame
-  A DataFrame represents a (two-dimensional) table of data.
-  The DataFrame has both a row and a column index.
-  Attributes
    - .index returns the row index
    - .columns returns the column index
    - .values returns the data as an ndarray

In [32]:
# creating a DataFrame from a dictionary
adict = {'name': ['Mary', 'Betty', 'Jack', 'Scott', 'David', 'Lily'], 'gender': ['F',
          'F', 'M', 'M', 'M', 'F'], 'gpa': [3.5, 3.1, 2.75, 3.8, 2.9, 2.5]}
adf = DataFrame(adict)
adf

    name gender   gpa
0   Mary      F  3.50
1  Betty      F  3.10
2   Jack      M  2.75
3  Scott      M  3.80
4  David      M  2.90
5   Lily      F  2.50

In [ ]:
# head and tail methods
print(adf.head())
adf.tail()

In [33]:
# NaN = missing values
adf2 = DataFrame(adict, columns = ['name', 'gender', 'gpa', 'major'], 
                    index = ['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
adf2

     name gender   gpa major
S1   Mary      F  3.50   NaN
S2  Betty      F  3.10   NaN
S3   Jack      M  2.75   NaN
S4  Scott      M  3.80   NaN
S5  David      M  2.90   NaN
S6   Lily      F  2.50   NaN

In [ ]:
# .columns and .index
print(adf2.columns)
adf2.index

In [ ]:
# a column retrieved as a Series
print(adf2['gpa'])   # by dict-like notation
adf2.gpa    # by attribute

In [ ]:
# multiple columns
print(adf2[['name', 'gpa']])
adf2[adf2.columns[1:3]]

In [ ]:
# a row retrieved as Series by the loc attribute
adf2.loc['S3']

In [34]:
# multiple rows
print(adf2.loc[['S1', 'S3']])
print(adf2[1:3])
(adf2['S1':'S3'])   # the last label is inclusive!

    name gender   gpa major
S1  Mary      F  3.50   NaN
S3  Jack      M  2.75   NaN
     name gender   gpa major
S2  Betty      F  3.10   NaN
S3   Jack      M  2.75   NaN

     name gender   gpa major
S1   Mary      F  3.50   NaN
S2  Betty      F  3.10   NaN
S3   Jack      M  2.75   NaN

In [35]:
# adding a column by assignment
adf2['honor'] = adf2.gpa >= 3.5
adf2

     name gender   gpa major  honor
S1   Mary      F  3.50   NaN   True
S2  Betty      F  3.10   NaN  False
S3   Jack      M  2.75   NaN  False
S4  Scott      M  3.80   NaN   True
S5  David      M  2.90   NaN  False
S6   Lily      F  2.50   NaN  False

In [36]:
# revising a column
major = Series(['MGT', 'MGT', 'ACC', 'FIN', 'FIN', 'ACC'], 
                 index = ['S1', 'S3', 'S4', 'S6', 'S2', 'S5'])
adf2['major'] = major
adf2

     name gender   gpa major  honor
S1   Mary      F  3.50   MGT   True
S2  Betty      F  3.10   FIN  False
S3   Jack      M  2.75   MGT  False
S4  Scott      M  3.80   ACC   True
S5  David      M  2.90   ACC  False
S6   Lily      F  2.50   FIN  False

In [ ]:
# deleting columns
del adf2['honor']
adf2

In [37]:
# .values attribute returns data as a two-dimensional ndarray
adf2.values

array([['Mary', 'F', 3.5, 'MGT', True],
       ['Betty', 'F', 3.1, 'FIN', False],
       ['Jack', 'M', 2.75, 'MGT', False],
       ['Scott', 'M', 3.8, 'ACC', True],
       ['David', 'M', 2.9, 'ACC', False],
       ['Lily', 'F', 2.5, 'FIN', False]], dtype=object)

## Interacting with Data

### Indexing, Selection and Filtering
- Indexing options
    - df[val]  
        - column label or labels: a single column or subset of columns; 
        - boolean array: selected rows;
        - slicing: slicing rows
    - df.loc[val] or df.iloc[where] 
        - a single row or subset of rows
    - df.loc[:, val] or df.iloc[:, where] 
        - a single column or subset of columns
    - df.loc[val_i, val_j] or df.iloc[where_i, where_j]  
        - both rows and columns
   
   
 - .loc for labels and .iloc for integer positions

In [39]:
# Series indexing similar to Numpy array indexing
bobj = Series({val: key for key, val in enumerate('abcde')})
print(bobj)
bobj[1:3]

a    0
b    1
c    2
d    3
e    4
dtype: int64

b    1
c    2
dtype: int64

In [ ]:
# Series indexing with index values
bobj[['b', 'c', 'e']]

In [46]:
# DataFrame indexing by column
bdf = DataFrame({val: [key * m for m in range(4)] for key, val in enumerate('abcde')})
print(bdf)
bdf[['a', 'd']]

   a  b  c  d   e
0  0  0  0  0   0
1  0  1  2  3   4
2  0  2  4  6   8
3  0  3  6  9  12

   a  d
0  0  0
1  0  3
2  0  6
3  0  9

In [ ]:
# DataFrame indexing by row
bdf[1:3]

In [43]:
# DataFrame masking
bdf[bdf < 5] = 5
bdf

   a  b  c  d   e
0  5  5  5  5   5
1  5  5  5  5   5
2  5  5  5  6   8
3  5  5  6  9  12

In [44]:
# selection both rows and columns with .loc
bdf.loc[[1, 3], ['a', 'e']]

   a   e
1  5   5
3  5  12

In [47]:
# selection by integer position with .iloc
bdf.iloc[[1,3], [2,4]]

   c   e
1  2   4
3  6  12

In [48]:
# slicing
print(bdf.loc[:3, :'d'])    # the last label is inclusive
bdf.iloc[:, :3][bdf.d < 6]    # the last integer position is exclusive

   a  b  c  d
0  0  0  0  0
1  0  1  2  3
2  0  2  4  6
3  0  3  6  9

   a  b  c
0  0  0  0
1  0  1  2

In [49]:
# a single column or subset of columns
print(bdf.loc[:, ['a', 'b']])
bdf.iloc[:, 0:2]

   a  b
0  0  0
1  0  1
2  0  2
3  0  3

   a  b
0  0  0
1  0  1
2  0  2
3  0  3

### Arithmetic Operations and Data Alignment
- Arithmetics between objects with different indexes
    - Index in the result will be the union of the index pairs.
    - Missing values are introduced in the label locations that don't overlap.
- Operations between DataFrame and Series are defined.

In [50]:
# objects with different indexes
df1 = DataFrame({'A': [1, 2], 'B': [3, 4]})
df2 = DataFrame({'A': [5, 6]})
print(df1)
print(df2)
df1 + df2    # NA values would be introduced

   A  B
0  1  3
1  2  4
   A
0  5
1  6

   A   B
0  6 NaN
1  8 NaN

In [ ]:
# a filled value when an axis label is missing in an object
df1.add(df2, fill_value = 0)

### Function Applications
- Numpy ufuncs also work with pandas objects.
- apply()

In [51]:
cdf = DataFrame(np.random.randn(3, 4), columns = list('abcd'), 
                   index = list('ABC'))
print(cdf)
np.abs(cdf)

          a         b         c         d
A  0.726669 -0.163633  0.875479 -0.143747
B -0.451103  1.151992  0.294974 -1.040029
C -0.560699  2.308879 -0.989475 -1.138326

          a         b         c         d
A  0.726669  0.163633  0.875479  0.143747
B  0.451103  1.151992  0.294974  1.040029
C  0.560699  2.308879  0.989475  1.138326

In [52]:
# apply() runs on each column be default
print(cdf.apply(lambda x: x.max() - x.min()))
# apply() runs on each row
cdf.apply(lambda x: x.max() - x.min(), axis = 1)

a    1.287367
b    2.472512
c    1.864954
d    0.994579
dtype: float64

A    1.039112
B    2.192021
C    3.447205
dtype: float64

### Sorting and Ranking
- sort_index()
- sort_values()
- rank()

In [ ]:
# sorting by row index
ddf = DataFrame(np.arange(12).reshape((3, 4)), columns = list('bdac'), 
                   index = list('BCA'))
print(ddf)
ddf.sort_index()

In [ ]:
# sorting by column index
ddf.sort_index(axis = 1)

In [ ]:
# sorting in descending order
ddf.sort_index(ascending = False)

In [ ]:
# sorting by a column
ddf.sort_values(by = 'a')
ddf

In [ ]:
# sorting by multiple columns
edf = ddf.copy()
edf['d'] = 5
print(edf)
edf.sort_values(['d', 'b'], ascending = False)

In [ ]:
# ranks assigned
print(edf)
edf.rank()    # from smallest to largest

In [ ]:
edf.rank(method = 'max', ascending = False)   # tie-breaking method: highest rank

## Descriptive Statistics

In [4]:
# summary statistics by column
np.random.seed(12345)
fdf = DataFrame(np.random.randn(4, 3), columns = list('abc'), 
                   index = list('ABCD'))
print(fdf)
print(fdf.sum())
print(fdf.mean())
print(fdf.max())
print(fdf.idxmax())   # index

          a         b         c
A -0.204708  0.478943 -0.519439
B -0.555730  1.965781  1.393406
C  0.092908  0.281746  0.769023
D  1.246435  1.007189 -1.296221
a    0.578905
b    3.733659
c    0.346769
dtype: float64
a    0.144726
b    0.933415
c    0.086692
dtype: float64
a    1.246435
b    1.965781
c    1.393406
dtype: float64
a    D
b    B
c    B
dtype: object

In [3]:
# summary statistics by row
fdf.sum(axis = 1)

A   -0.245203
B    2.803456
C    1.143677
D    0.957403
dtype: float64

In [8]:
fdf.c.idxmax()

'B'

In [54]:
# multiple summary statistics
fdf.describe()

              a         b         c
count  4.000000  4.000000  4.000000
mean   0.144726  0.933415  0.086692
std    0.780852  0.753312  1.218321
min   -0.555730  0.281746 -1.296221
25%   -0.292463  0.429644 -0.713634
50%   -0.055900  0.743066  0.124792
75%    0.381290  1.246837  0.925118
max    1.246435  1.965781  1.393406

In [55]:
fdf.loc['A', 'c'] = 'NaN'
print(fdf)
fdf.sum()    # exclusing missing values

          a         b         c
A -0.204708  0.478943       NaN
B -0.555730  1.965781   1.39341
C  0.092908  0.281746  0.769023
D  1.246435  1.007189  -1.29622

a    0.578905
b    3.733659
dtype: float64

In [9]:
# correlation
fdf.a.corr(fdf.b)

-0.25459237040175636

In [10]:
# unique values and value counts
ser3 = Series(['a', 'b', 'a', 'c', 'b', 'a'])
print(ser3.unique())
ser3.value_counts()

['a' 'b' 'c']

a    3
b    2
c    1
dtype: int64

In [11]:
# membership
print(ser3.isin(['b', 'c']))
ser3[ser3.isin(['b', 'c'])]

0    False
1     True
2    False
3     True
4     True
5    False
dtype: bool

1    b
3    c
4    b
dtype: object

In [12]:
# frequency distribution by column
gdf = DataFrame({'q1': [1, 3, 4, 5, 3], 'q2': [2, 2, 3, 5, 1], 
                    'q3': [3, 1, 2, 4, 1]})
print(gdf)
freq = gdf.apply(pd.value_counts).fillna(0)
freq

   q1  q2  q3
0   1   2   3
1   3   2   1
2   4   3   2
3   5   5   4
4   3   1   1

    q1   q2   q3
1  1.0  1.0  2.0
2  0.0  2.0  1.0
3  2.0  1.0  1.0
4  1.0  0.0  1.0
5  1.0  1.0  0.0

In [ ]:
# groupby
gdf['q4'] = Series(list('abadb'))
print(gdf)
gdf.groupby('q4').max()